Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/smc.h
/**
 * \brief Component description for SMC
 *
 * Copyright (c) 2018 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2018-11-28T22:21:13Z */
#ifndef _SAMA5D2_SMC_COMPONENT_H_
#define _SAMA5D2_SMC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SMC                                          */
/* ************************************************************************** */

/* -------- HSMC_SETUP : (SMC Offset: 0x00) (R/W 32) Setup Register -------- */
#define HSMC_SETUP_NWE_SETUP_Pos              _U_(0)                                               /**< (HSMC_SETUP) NWE Setup Length Position */
#define HSMC_SETUP_NWE_SETUP_Msk              (_U_(0x3F) << HSMC_SETUP_NWE_SETUP_Pos)              /**< (HSMC_SETUP) NWE Setup Length Mask */
#define HSMC_SETUP_NWE_SETUP(value)           (HSMC_SETUP_NWE_SETUP_Msk & ((value) << HSMC_SETUP_NWE_SETUP_Pos))
#define HSMC_SETUP_NCS_WR_SETUP_Pos           _U_(8)                                               /**< (HSMC_SETUP) NCS Setup Length in Write Access Position */
#define HSMC_SETUP_NCS_WR_SETUP_Msk           (_U_(0x3F) << HSMC_SETUP_NCS_WR_SETUP_Pos)           /**< (HSMC_SETUP) NCS Setup Length in Write Access Mask */
#define HSMC_SETUP_NCS_WR_SETUP(value)        (HSMC_SETUP_NCS_WR_SETUP_Msk & ((value) << HSMC_SETUP_NCS_WR_SETUP_Pos))
#define HSMC_SETUP_NRD_SETUP_Pos              _U_(16)                                              /**< (HSMC_SETUP) NRD Setup Length Position */
#define HSMC_SETUP_NRD_SETUP_Msk              (_U_(0x3F) << HSMC_SETUP_NRD_SETUP_Pos)              /**< (HSMC_SETUP) NRD Setup Length Mask */
#define HSMC_SETUP_NRD_SETUP(value)           (HSMC_SETUP_NRD_SETUP_Msk & ((value) << HSMC_SETUP_NRD_SETUP_Pos))
#define HSMC_SETUP_NCS_RD_SETUP_Pos           _U_(24)                                              /**< (HSMC_SETUP) NCS Setup Length in Read Access Position */
#define HSMC_SETUP_NCS_RD_SETUP_Msk           (_U_(0x3F) << HSMC_SETUP_NCS_RD_SETUP_Pos)           /**< (HSMC_SETUP) NCS Setup Length in Read Access Mask */
#define HSMC_SETUP_NCS_RD_SETUP(value)        (HSMC_SETUP_NCS_RD_SETUP_Msk & ((value) << HSMC_SETUP_NCS_RD_SETUP_Pos))
#define HSMC_SETUP_Msk                        _U_(0x3F3F3F3F)                                      /**< (HSMC_SETUP) Register Mask  */


/* -------- HSMC_PULSE : (SMC Offset: 0x04) (R/W 32) Pulse Register -------- */
#define HSMC_PULSE_NWE_PULSE_Pos              _U_(0)                                               /**< (HSMC_PULSE) NWE Pulse Length Position */
#define HSMC_PULSE_NWE_PULSE_Msk              (_U_(0x7F) << HSMC_PULSE_NWE_PULSE_Pos)              /**< (HSMC_PULSE) NWE Pulse Length Mask */
#define HSMC_PULSE_NWE_PULSE(value)           (HSMC_PULSE_NWE_PULSE_Msk & ((value) << HSMC_PULSE_NWE_PULSE_Pos))
#define HSMC_PULSE_NCS_WR_PULSE_Pos           _U_(8)                                               /**< (HSMC_PULSE) NCS Pulse Length in WRITE Access Position */
#define HSMC_PULSE_NCS_WR_PULSE_Msk           (_U_(0x7F) << HSMC_PULSE_NCS_WR_PULSE_Pos)           /**< (HSMC_PULSE) NCS Pulse Length in WRITE Access Mask */
#define HSMC_PULSE_NCS_WR_PULSE(value)        (HSMC_PULSE_NCS_WR_PULSE_Msk & ((value) << HSMC_PULSE_NCS_WR_PULSE_Pos))
#define HSMC_PULSE_NRD_PULSE_Pos              _U_(16)                                              /**< (HSMC_PULSE) NRD Pulse Length Position */
#define HSMC_PULSE_NRD_PULSE_Msk              (_U_(0x7F) << HSMC_PULSE_NRD_PULSE_Pos)              /**< (HSMC_PULSE) NRD Pulse Length Mask */
#define HSMC_PULSE_NRD_PULSE(value)           (HSMC_PULSE_NRD_PULSE_Msk & ((value) << HSMC_PULSE_NRD_PULSE_Pos))
#define HSMC_PULSE_NCS_RD_PULSE_Pos           _U_(24)                                              /**< (HSMC_PULSE) NCS Pulse Length in READ Access Position */
#define HSMC_PULSE_NCS_RD_PULSE_Msk           (_U_(0x7F) << HSMC_PULSE_NCS_RD_PULSE_Pos)           /**< (HSMC_PULSE) NCS Pulse Length in READ Access Mask */
#define HSMC_PULSE_NCS_RD_PULSE(value)        (HSMC_PULSE_NCS_RD_PULSE_Msk & ((value) << HSMC_PULSE_NCS_RD_PULSE_Pos))
#define HSMC_PULSE_Msk                        _U_(0x7F7F7F7F)                                      /**< (HSMC_PULSE) Register Mask  */


/* -------- HSMC_CYCLE : (SMC Offset: 0x08) (R/W 32) Cycle Register -------- */
#define HSMC_CYCLE_NWE_CYCLE_Pos              _U_(0)                                               /**< (HSMC_CYCLE) Total Write Cycle Length Position */
#define HSMC_CYCLE_NWE_CYCLE_Msk              (_U_(0x1FF) << HSMC_CYCLE_NWE_CYCLE_Pos)             /**< (HSMC_CYCLE) Total Write Cycle Length Mask */
#define HSMC_CYCLE_NWE_CYCLE(value)           (HSMC_CYCLE_NWE_CYCLE_Msk & ((value) << HSMC_CYCLE_NWE_CYCLE_Pos))
#define HSMC_CYCLE_NRD_CYCLE_Pos              _U_(16)                                              /**< (HSMC_CYCLE) Total Read Cycle Length Position */
#define HSMC_CYCLE_NRD_CYCLE_Msk              (_U_(0x1FF) << HSMC_CYCLE_NRD_CYCLE_Pos)             /**< (HSMC_CYCLE) Total Read Cycle Length Mask */
#define HSMC_CYCLE_NRD_CYCLE(value)           (HSMC_CYCLE_NRD_CYCLE_Msk & ((value) << HSMC_CYCLE_NRD_CYCLE_Pos))
#define HSMC_CYCLE_Msk                        _U_(0x01FF01FF)                                      /**< (HSMC_CYCLE) Register Mask  */


