Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/smc.h
/* -------- HSMC_REM7_ : (SMC Offset: 0x1C) ( R/ 32) PMECC Remainder 7 Register (sec_num = 0) -------- */
#define HSMC_REM7__REM2NP1_Pos                _U_(0)                                               /**< (HSMC_REM7_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM7__REM2NP1_Msk                (_U_(0x3FFF) << HSMC_REM7__REM2NP1_Pos)              /**< (HSMC_REM7_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM7__REM2NP1(value)             (HSMC_REM7__REM2NP1_Msk & ((value) << HSMC_REM7__REM2NP1_Pos))
#define HSMC_REM7__REM2NP3_Pos                _U_(16)                                              /**< (HSMC_REM7_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM7__REM2NP3_Msk                (_U_(0x3FFF) << HSMC_REM7__REM2NP3_Pos)              /**< (HSMC_REM7_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM7__REM2NP3(value)             (HSMC_REM7__REM2NP3_Msk & ((value) << HSMC_REM7__REM2NP3_Pos))
#define HSMC_REM7__Msk                        _U_(0x3FFF3FFF)                                      /**< (HSMC_REM7_) Register Mask  */


/* -------- HSMC_REM8_ : (SMC Offset: 0x20) ( R/ 32) PMECC Remainder 8 Register (sec_num = 0) -------- */
#define HSMC_REM8__REM2NP1_Pos                _U_(0)                                               /**< (HSMC_REM8_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM8__REM2NP1_Msk                (_U_(0x3FFF) << HSMC_REM8__REM2NP1_Pos)              /**< (HSMC_REM8_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM8__REM2NP1(value)             (HSMC_REM8__REM2NP1_Msk & ((value) << HSMC_REM8__REM2NP1_Pos))
#define HSMC_REM8__REM2NP3_Pos                _U_(16)                                              /**< (HSMC_REM8_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM8__REM2NP3_Msk                (_U_(0x3FFF) << HSMC_REM8__REM2NP3_Pos)              /**< (HSMC_REM8_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM8__REM2NP3(value)             (HSMC_REM8__REM2NP3_Msk & ((value) << HSMC_REM8__REM2NP3_Pos))
#define HSMC_REM8__Msk                        _U_(0x3FFF3FFF)                                      /**< (HSMC_REM8_) Register Mask  */


/* -------- HSMC_REM9_ : (SMC Offset: 0x24) ( R/ 32) PMECC Remainder 9 Register (sec_num = 0) -------- */
#define HSMC_REM9__REM2NP1_Pos                _U_(0)                                               /**< (HSMC_REM9_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM9__REM2NP1_Msk                (_U_(0x3FFF) << HSMC_REM9__REM2NP1_Pos)              /**< (HSMC_REM9_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM9__REM2NP1(value)             (HSMC_REM9__REM2NP1_Msk & ((value) << HSMC_REM9__REM2NP1_Pos))
#define HSMC_REM9__REM2NP3_Pos                _U_(16)                                              /**< (HSMC_REM9_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM9__REM2NP3_Msk                (_U_(0x3FFF) << HSMC_REM9__REM2NP3_Pos)              /**< (HSMC_REM9_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM9__REM2NP3(value)             (HSMC_REM9__REM2NP3_Msk & ((value) << HSMC_REM9__REM2NP3_Pos))
#define HSMC_REM9__Msk                        _U_(0x3FFF3FFF)                                      /**< (HSMC_REM9_) Register Mask  */


/* -------- HSMC_REM10_ : (SMC Offset: 0x28) ( R/ 32) PMECC Remainder 10 Register (sec_num = 0) -------- */
#define HSMC_REM10__REM2NP1_Pos               _U_(0)                                               /**< (HSMC_REM10_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM10__REM2NP1_Msk               (_U_(0x3FFF) << HSMC_REM10__REM2NP1_Pos)             /**< (HSMC_REM10_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM10__REM2NP1(value)            (HSMC_REM10__REM2NP1_Msk & ((value) << HSMC_REM10__REM2NP1_Pos))
#define HSMC_REM10__REM2NP3_Pos               _U_(16)                                              /**< (HSMC_REM10_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM10__REM2NP3_Msk               (_U_(0x3FFF) << HSMC_REM10__REM2NP3_Pos)             /**< (HSMC_REM10_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM10__REM2NP3(value)            (HSMC_REM10__REM2NP3_Msk & ((value) << HSMC_REM10__REM2NP3_Pos))
#define HSMC_REM10__Msk                       _U_(0x3FFF3FFF)                                      /**< (HSMC_REM10_) Register Mask  */


/* -------- HSMC_REM11_ : (SMC Offset: 0x2C) ( R/ 32) PMECC Remainder 11 Register (sec_num = 0) -------- */
#define HSMC_REM11__REM2NP1_Pos               _U_(0)                                               /**< (HSMC_REM11_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM11__REM2NP1_Msk               (_U_(0x3FFF) << HSMC_REM11__REM2NP1_Pos)             /**< (HSMC_REM11_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM11__REM2NP1(value)            (HSMC_REM11__REM2NP1_Msk & ((value) << HSMC_REM11__REM2NP1_Pos))
#define HSMC_REM11__REM2NP3_Pos               _U_(16)                                              /**< (HSMC_REM11_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM11__REM2NP3_Msk               (_U_(0x3FFF) << HSMC_REM11__REM2NP3_Pos)             /**< (HSMC_REM11_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM11__REM2NP3(value)            (HSMC_REM11__REM2NP3_Msk & ((value) << HSMC_REM11__REM2NP3_Pos))
#define HSMC_REM11__Msk                       _U_(0x3FFF3FFF)                                      /**< (HSMC_REM11_) Register Mask  */


/* -------- HSMC_REM12_ : (SMC Offset: 0x30) ( R/ 32) PMECC Remainder 12 Register (sec_num = 0) -------- */
#define HSMC_REM12__REM2NP1_Pos               _U_(0)                                               /**< (HSMC_REM12_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM12__REM2NP1_Msk               (_U_(0x3FFF) << HSMC_REM12__REM2NP1_Pos)             /**< (HSMC_REM12_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM12__REM2NP1(value)            (HSMC_REM12__REM2NP1_Msk & ((value) << HSMC_REM12__REM2NP1_Pos))
#define HSMC_REM12__REM2NP3_Pos               _U_(16)                                              /**< (HSMC_REM12_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM12__REM2NP3_Msk               (_U_(0x3FFF) << HSMC_REM12__REM2NP3_Pos)             /**< (HSMC_REM12_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM12__REM2NP3(value)            (HSMC_REM12__REM2NP3_Msk & ((value) << HSMC_REM12__REM2NP3_Pos))
#define HSMC_REM12__Msk                       _U_(0x3FFF3FFF)                                      /**< (HSMC_REM12_) Register Mask  */


/* -------- HSMC_REM13_ : (SMC Offset: 0x34) ( R/ 32) PMECC Remainder 13 Register (sec_num = 0) -------- */
#define HSMC_REM13__REM2NP1_Pos               _U_(0)                                               /**< (HSMC_REM13_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM13__REM2NP1_Msk               (_U_(0x3FFF) << HSMC_REM13__REM2NP1_Pos)             /**< (HSMC_REM13_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM13__REM2NP1(value)            (HSMC_REM13__REM2NP1_Msk & ((value) << HSMC_REM13__REM2NP1_Pos))
#define HSMC_REM13__REM2NP3_Pos               _U_(16)                                              /**< (HSMC_REM13_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM13__REM2NP3_Msk               (_U_(0x3FFF) << HSMC_REM13__REM2NP3_Pos)             /**< (HSMC_REM13_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM13__REM2NP3(value)            (HSMC_REM13__REM2NP3_Msk & ((value) << HSMC_REM13__REM2NP3_Pos))
#define HSMC_REM13__Msk                       _U_(0x3FFF3FFF)                                      /**< (HSMC_REM13_) Register Mask  */


/* -------- HSMC_REM14_ : (SMC Offset: 0x38) ( R/ 32) PMECC Remainder 14 Register (sec_num = 0) -------- */
#define HSMC_REM14__REM2NP1_Pos               _U_(0)                                               /**< (HSMC_REM14_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM14__REM2NP1_Msk               (_U_(0x3FFF) << HSMC_REM14__REM2NP1_Pos)             /**< (HSMC_REM14_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM14__REM2NP1(value)            (HSMC_REM14__REM2NP1_Msk & ((value) << HSMC_REM14__REM2NP1_Pos))
#define HSMC_REM14__REM2NP3_Pos               _U_(16)                                              /**< (HSMC_REM14_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM14__REM2NP3_Msk               (_U_(0x3FFF) << HSMC_REM14__REM2NP3_Pos)             /**< (HSMC_REM14_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM14__REM2NP3(value)            (HSMC_REM14__REM2NP3_Msk & ((value) << HSMC_REM14__REM2NP3_Pos))
#define HSMC_REM14__Msk                       _U_(0x3FFF3FFF)                                      /**< (HSMC_REM14_) Register Mask  */


/* -------- HSMC_REM15_ : (SMC Offset: 0x3C) ( R/ 32) PMECC Remainder 15 Register (sec_num = 0) -------- */
#define HSMC_REM15__REM2NP1_Pos               _U_(0)                                               /**< (HSMC_REM15_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM15__REM2NP1_Msk               (_U_(0x3FFF) << HSMC_REM15__REM2NP1_Pos)             /**< (HSMC_REM15_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM15__REM2NP1(value)            (HSMC_REM15__REM2NP1_Msk & ((value) << HSMC_REM15__REM2NP1_Pos))
#define HSMC_REM15__REM2NP3_Pos               _U_(16)                                              /**< (HSMC_REM15_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM15__REM2NP3_Msk               (_U_(0x3FFF) << HSMC_REM15__REM2NP3_Pos)             /**< (HSMC_REM15_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM15__REM2NP3(value)            (HSMC_REM15__REM2NP3_Msk & ((value) << HSMC_REM15__REM2NP3_Pos))
#define HSMC_REM15__Msk                       _U_(0x3FFF3FFF)                                      /**< (HSMC_REM15_) Register Mask  */


/* -------- HSMC_CFG : (SMC Offset: 0x00) (R/W 32) NFC Configuration Register -------- */
#define HSMC_CFG_PAGESIZE_Pos                 _U_(0)                                               /**< (HSMC_CFG) Page Size of the NAND Flash Device Position */
#define HSMC_CFG_PAGESIZE_Msk                 (_U_(0x7) << HSMC_CFG_PAGESIZE_Pos)                  /**< (HSMC_CFG) Page Size of the NAND Flash Device Mask */
#define HSMC_CFG_PAGESIZE(value)              (HSMC_CFG_PAGESIZE_Msk & ((value) << HSMC_CFG_PAGESIZE_Pos))
#define   HSMC_CFG_PAGESIZE_PS512_Val         _U_(0x0)                                             /**< (HSMC_CFG) Main area 512 bytes  */
#define   HSMC_CFG_PAGESIZE_PS1024_Val        _U_(0x1)                                             /**< (HSMC_CFG) Main area 1024 bytes  */
#define   HSMC_CFG_PAGESIZE_PS2048_Val        _U_(0x2)                                             /**< (HSMC_CFG) Main area 2048 bytes  */
#define   HSMC_CFG_PAGESIZE_PS4096_Val        _U_(0x3)                                             /**< (HSMC_CFG) Main area 4096 bytes  */
#define   HSMC_CFG_PAGESIZE_PS8192_Val        _U_(0x4)                                             /**< (HSMC_CFG) Main area 8192 bytes  */
#define HSMC_CFG_PAGESIZE_PS512               (HSMC_CFG_PAGESIZE_PS512_Val << HSMC_CFG_PAGESIZE_Pos) /**< (HSMC_CFG) Main area 512 bytes Position  */
#define HSMC_CFG_PAGESIZE_PS1024              (HSMC_CFG_PAGESIZE_PS1024_Val << HSMC_CFG_PAGESIZE_Pos) /**< (HSMC_CFG) Main area 1024 bytes Position  */
#define HSMC_CFG_PAGESIZE_PS2048              (HSMC_CFG_PAGESIZE_PS2048_Val << HSMC_CFG_PAGESIZE_Pos) /**< (HSMC_CFG) Main area 2048 bytes Position  */
#define HSMC_CFG_PAGESIZE_PS4096              (HSMC_CFG_PAGESIZE_PS4096_Val << HSMC_CFG_PAGESIZE_Pos) /**< (HSMC_CFG) Main area 4096 bytes Position  */
#define HSMC_CFG_PAGESIZE_PS8192              (HSMC_CFG_PAGESIZE_PS8192_Val << HSMC_CFG_PAGESIZE_Pos) /**< (HSMC_CFG) Main area 8192 bytes Position  */
#define HSMC_CFG_WSPARE_Pos                   _U_(8)                                               /**< (HSMC_CFG) Write Spare Area Position */
#define HSMC_CFG_WSPARE_Msk                   (_U_(0x1) << HSMC_CFG_WSPARE_Pos)                    /**< (HSMC_CFG) Write Spare Area Mask */
#define HSMC_CFG_WSPARE(value)                (HSMC_CFG_WSPARE_Msk & ((value) << HSMC_CFG_WSPARE_Pos))
#define HSMC_CFG_RSPARE_Pos                   _U_(9)                                               /**< (HSMC_CFG) Read Spare Area Position */
#define HSMC_CFG_RSPARE_Msk                   (_U_(0x1) << HSMC_CFG_RSPARE_Pos)                    /**< (HSMC_CFG) Read Spare Area Mask */
#define HSMC_CFG_RSPARE(value)                (HSMC_CFG_RSPARE_Msk & ((value) << HSMC_CFG_RSPARE_Pos))
#define HSMC_CFG_EDGECTRL_Pos                 _U_(12)                                              /**< (HSMC_CFG) Rising/Falling Edge Detection Control Position */
#define HSMC_CFG_EDGECTRL_Msk                 (_U_(0x1) << HSMC_CFG_EDGECTRL_Pos)                  /**< (HSMC_CFG) Rising/Falling Edge Detection Control Mask */
#define HSMC_CFG_EDGECTRL(value)              (HSMC_CFG_EDGECTRL_Msk & ((value) << HSMC_CFG_EDGECTRL_Pos))
#define HSMC_CFG_RBEDGE_Pos                   _U_(13)                                              /**< (HSMC_CFG) Ready/Busy Signal Edge Detection Position */
#define HSMC_CFG_RBEDGE_Msk                   (_U_(0x1) << HSMC_CFG_RBEDGE_Pos)                    /**< (HSMC_CFG) Ready/Busy Signal Edge Detection Mask */
#define HSMC_CFG_RBEDGE(value)                (HSMC_CFG_RBEDGE_Msk & ((value) << HSMC_CFG_RBEDGE_Pos))
#define HSMC_CFG_DTOCYC_Pos                   _U_(16)                                              /**< (HSMC_CFG) Data Timeout Cycle Number Position */
#define HSMC_CFG_DTOCYC_Msk                   (_U_(0xF) << HSMC_CFG_DTOCYC_Pos)                    /**< (HSMC_CFG) Data Timeout Cycle Number Mask */
#define HSMC_CFG_DTOCYC(value)                (HSMC_CFG_DTOCYC_Msk & ((value) << HSMC_CFG_DTOCYC_Pos))
#define HSMC_CFG_DTOMUL_Pos                   _U_(20)                                              /**< (HSMC_CFG) Data Timeout Multiplier Position */
#define HSMC_CFG_DTOMUL_Msk                   (_U_(0x7) << HSMC_CFG_DTOMUL_Pos)                    /**< (HSMC_CFG) Data Timeout Multiplier Mask */
#define HSMC_CFG_DTOMUL(value)                (HSMC_CFG_DTOMUL_Msk & ((value) << HSMC_CFG_DTOMUL_Pos))
#define   HSMC_CFG_DTOMUL_X1_Val              _U_(0x0)                                             /**< (HSMC_CFG) DTOCYC  */
#define   HSMC_CFG_DTOMUL_X16_Val             _U_(0x1)                                             /**< (HSMC_CFG) DTOCYC x 16  */
#define   HSMC_CFG_DTOMUL_X128_Val            _U_(0x2)                                             /**< (HSMC_CFG) DTOCYC x 128  */
#define   HSMC_CFG_DTOMUL_X256_Val            _U_(0x3)                                             /**< (HSMC_CFG) DTOCYC x 256  */
#define   HSMC_CFG_DTOMUL_X1024_Val           _U_(0x4)                                             /**< (HSMC_CFG) DTOCYC x 1024  */
#define   HSMC_CFG_DTOMUL_X4096_Val           _U_(0x5)                                             /**< (HSMC_CFG) DTOCYC x 4096  */
#define   HSMC_CFG_DTOMUL_X65536_Val          _U_(0x6)                                             /**< (HSMC_CFG) DTOCYC x 65536  */
#define   HSMC_CFG_DTOMUL_X1048576_Val        _U_(0x7)                                             /**< (HSMC_CFG) DTOCYC x 1048576  */
#define HSMC_CFG_DTOMUL_X1                    (HSMC_CFG_DTOMUL_X1_Val << HSMC_CFG_DTOMUL_Pos)      /**< (HSMC_CFG) DTOCYC Position  */
#define HSMC_CFG_DTOMUL_X16                   (HSMC_CFG_DTOMUL_X16_Val << HSMC_CFG_DTOMUL_Pos)     /**< (HSMC_CFG) DTOCYC x 16 Position  */
#define HSMC_CFG_DTOMUL_X128                  (HSMC_CFG_DTOMUL_X128_Val << HSMC_CFG_DTOMUL_Pos)    /**< (HSMC_CFG) DTOCYC x 128 Position  */
#define HSMC_CFG_DTOMUL_X256                  (HSMC_CFG_DTOMUL_X256_Val << HSMC_CFG_DTOMUL_Pos)    /**< (HSMC_CFG) DTOCYC x 256 Position  */
#define HSMC_CFG_DTOMUL_X1024                 (HSMC_CFG_DTOMUL_X1024_Val << HSMC_CFG_DTOMUL_Pos)   /**< (HSMC_CFG) DTOCYC x 1024 Position  */
#define HSMC_CFG_DTOMUL_X4096                 (HSMC_CFG_DTOMUL_X4096_Val << HSMC_CFG_DTOMUL_Pos)   /**< (HSMC_CFG) DTOCYC x 4096 Position  */
#define HSMC_CFG_DTOMUL_X65536                (HSMC_CFG_DTOMUL_X65536_Val << HSMC_CFG_DTOMUL_Pos)  /**< (HSMC_CFG) DTOCYC x 65536 Position  */
#define HSMC_CFG_DTOMUL_X1048576              (HSMC_CFG_DTOMUL_X1048576_Val << HSMC_CFG_DTOMUL_Pos) /**< (HSMC_CFG) DTOCYC x 1048576 Position  */
#define HSMC_CFG_NFCSPARESIZE_Pos             _U_(24)                                              /**< (HSMC_CFG) NAND Flash Spare Area Size Retrieved by the Host Controller Position */
#define HSMC_CFG_NFCSPARESIZE_Msk             (_U_(0x7F) << HSMC_CFG_NFCSPARESIZE_Pos)             /**< (HSMC_CFG) NAND Flash Spare Area Size Retrieved by the Host Controller Mask */
#define HSMC_CFG_NFCSPARESIZE(value)          (HSMC_CFG_NFCSPARESIZE_Msk & ((value) << HSMC_CFG_NFCSPARESIZE_Pos))
#define HSMC_CFG_Msk                          _U_(0x7F7F3307)                                      /**< (HSMC_CFG) Register Mask  */


/* -------- HSMC_CTRL : (SMC Offset: 0x04) ( /W 32) NFC Control Register -------- */
#define HSMC_CTRL_NFCEN_Pos                   _U_(0)                                               /**< (HSMC_CTRL) NAND Flash Controller Enable Position */
#define HSMC_CTRL_NFCEN_Msk                   (_U_(0x1) << HSMC_CTRL_NFCEN_Pos)                    /**< (HSMC_CTRL) NAND Flash Controller Enable Mask */
#define HSMC_CTRL_NFCEN(value)                (HSMC_CTRL_NFCEN_Msk & ((value) << HSMC_CTRL_NFCEN_Pos))
#define HSMC_CTRL_NFCDIS_Pos                  _U_(1)                                               /**< (HSMC_CTRL) NAND Flash Controller Disable Position */
#define HSMC_CTRL_NFCDIS_Msk                  (_U_(0x1) << HSMC_CTRL_NFCDIS_Pos)                   /**< (HSMC_CTRL) NAND Flash Controller Disable Mask */
#define HSMC_CTRL_NFCDIS(value)               (HSMC_CTRL_NFCDIS_Msk & ((value) << HSMC_CTRL_NFCDIS_Pos))
#define HSMC_CTRL_Msk                         _U_(0x00000003)                                      /**< (HSMC_CTRL) Register Mask  */


/* -------- HSMC_SR : (SMC Offset: 0x08) ( R/ 32) NFC Status Register -------- */
#define HSMC_SR_SMCSTS_Pos                    _U_(0)                                               /**< (HSMC_SR) NAND Flash Controller Status (this field cannot be reset) Position */
#define HSMC_SR_SMCSTS_Msk                    (_U_(0x1) << HSMC_SR_SMCSTS_Pos)                     /**< (HSMC_SR) NAND Flash Controller Status (this field cannot be reset) Mask */
#define HSMC_SR_SMCSTS(value)                 (HSMC_SR_SMCSTS_Msk & ((value) << HSMC_SR_SMCSTS_Pos))
#define HSMC_SR_RB_RISE_Pos                   _U_(4)                                               /**< (HSMC_SR) Selected Ready Busy Rising Edge Detected Position */
#define HSMC_SR_RB_RISE_Msk                   (_U_(0x1) << HSMC_SR_RB_RISE_Pos)                    /**< (HSMC_SR) Selected Ready Busy Rising Edge Detected Mask */
#define HSMC_SR_RB_RISE(value)                (HSMC_SR_RB_RISE_Msk & ((value) << HSMC_SR_RB_RISE_Pos))
#define HSMC_SR_RB_FALL_Pos                   _U_(5)                                               /**< (HSMC_SR) Selected Ready Busy Falling Edge Detected Position */
#define HSMC_SR_RB_FALL_Msk                   (_U_(0x1) << HSMC_SR_RB_FALL_Pos)                    /**< (HSMC_SR) Selected Ready Busy Falling Edge Detected Mask */
#define HSMC_SR_RB_FALL(value)                (HSMC_SR_RB_FALL_Msk & ((value) << HSMC_SR_RB_FALL_Pos))
#define HSMC_SR_NFCBUSY_Pos                   _U_(8)                                               /**< (HSMC_SR) NFC Busy (this field cannot be reset) Position */
#define HSMC_SR_NFCBUSY_Msk                   (_U_(0x1) << HSMC_SR_NFCBUSY_Pos)                    /**< (HSMC_SR) NFC Busy (this field cannot be reset) Mask */
#define HSMC_SR_NFCBUSY(value)                (HSMC_SR_NFCBUSY_Msk & ((value) << HSMC_SR_NFCBUSY_Pos))
#define HSMC_SR_NFCWR_Pos                     _U_(11)                                              /**< (HSMC_SR) NFC Write/Read Operation (this field cannot be reset) Position */
#define HSMC_SR_NFCWR_Msk                     (_U_(0x1) << HSMC_SR_NFCWR_Pos)                      /**< (HSMC_SR) NFC Write/Read Operation (this field cannot be reset) Mask */
#define HSMC_SR_NFCWR(value)                  (HSMC_SR_NFCWR_Msk & ((value) << HSMC_SR_NFCWR_Pos))
#define HSMC_SR_NFCSID_Pos                    _U_(12)                                              /**< (HSMC_SR) NFC Chip Select ID (this field cannot be reset) Position */
#define HSMC_SR_NFCSID_Msk                    (_U_(0x7) << HSMC_SR_NFCSID_Pos)                     /**< (HSMC_SR) NFC Chip Select ID (this field cannot be reset) Mask */
#define HSMC_SR_NFCSID(value)                 (HSMC_SR_NFCSID_Msk & ((value) << HSMC_SR_NFCSID_Pos))
#define HSMC_SR_XFRDONE_Pos                   _U_(16)                                              /**< (HSMC_SR) NFC Data Transfer Terminated Position */
#define HSMC_SR_XFRDONE_Msk                   (_U_(0x1) << HSMC_SR_XFRDONE_Pos)                    /**< (HSMC_SR) NFC Data Transfer Terminated Mask */
#define HSMC_SR_XFRDONE(value)                (HSMC_SR_XFRDONE_Msk & ((value) << HSMC_SR_XFRDONE_Pos))
#define HSMC_SR_CMDDONE_Pos                   _U_(17)                                              /**< (HSMC_SR) Command Done Position */
#define HSMC_SR_CMDDONE_Msk                   (_U_(0x1) << HSMC_SR_CMDDONE_Pos)                    /**< (HSMC_SR) Command Done Mask */
#define HSMC_SR_CMDDONE(value)                (HSMC_SR_CMDDONE_Msk & ((value) << HSMC_SR_CMDDONE_Pos))
#define HSMC_SR_DTOE_Pos                      _U_(20)                                              /**< (HSMC_SR) Data Timeout Error Position */
#define HSMC_SR_DTOE_Msk                      (_U_(0x1) << HSMC_SR_DTOE_Pos)                       /**< (HSMC_SR) Data Timeout Error Mask */
#define HSMC_SR_DTOE(value)                   (HSMC_SR_DTOE_Msk & ((value) << HSMC_SR_DTOE_Pos))  
#define HSMC_SR_UNDEF_Pos                     _U_(21)                                              /**< (HSMC_SR) Undefined Area Error Position */
#define HSMC_SR_UNDEF_Msk                     (_U_(0x1) << HSMC_SR_UNDEF_Pos)                      /**< (HSMC_SR) Undefined Area Error Mask */
#define HSMC_SR_UNDEF(value)                  (HSMC_SR_UNDEF_Msk & ((value) << HSMC_SR_UNDEF_Pos))
#define HSMC_SR_AWB_Pos                       _U_(22)                                              /**< (HSMC_SR) Accessing While Busy Position */
#define HSMC_SR_AWB_Msk                       (_U_(0x1) << HSMC_SR_AWB_Pos)                        /**< (HSMC_SR) Accessing While Busy Mask */
#define HSMC_SR_AWB(value)                    (HSMC_SR_AWB_Msk & ((value) << HSMC_SR_AWB_Pos))    
#define HSMC_SR_NFCASE_Pos                    _U_(23)                                              /**< (HSMC_SR) NFC Access Size Error Position */
#define HSMC_SR_NFCASE_Msk                    (_U_(0x1) << HSMC_SR_NFCASE_Pos)                     /**< (HSMC_SR) NFC Access Size Error Mask */
#define HSMC_SR_NFCASE(value)                 (HSMC_SR_NFCASE_Msk & ((value) << HSMC_SR_NFCASE_Pos))
#define HSMC_SR_RB_EDGE0_Pos                  _U_(24)                                              /**< (HSMC_SR) Ready/Busy Line 0 Edge Detected Position */
#define HSMC_SR_RB_EDGE0_Msk                  (_U_(0x1) << HSMC_SR_RB_EDGE0_Pos)                   /**< (HSMC_SR) Ready/Busy Line 0 Edge Detected Mask */
#define HSMC_SR_RB_EDGE0(value)               (HSMC_SR_RB_EDGE0_Msk & ((value) << HSMC_SR_RB_EDGE0_Pos))
#define HSMC_SR_Msk                           _U_(0x01F37931)                                      /**< (HSMC_SR) Register Mask  */

