Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/smc.h
/* -------- HSMC_PMECCEADDR : (SMC Offset: 0x7C) (R/W 32) PMECC End Address Register -------- */
#define HSMC_PMECCEADDR_ENDADDR_Pos           _U_(0)                                               /**< (HSMC_PMECCEADDR) ECC Area End Address Position */
#define HSMC_PMECCEADDR_ENDADDR_Msk           (_U_(0x1FF) << HSMC_PMECCEADDR_ENDADDR_Pos)          /**< (HSMC_PMECCEADDR) ECC Area End Address Mask */
#define HSMC_PMECCEADDR_ENDADDR(value)        (HSMC_PMECCEADDR_ENDADDR_Msk & ((value) << HSMC_PMECCEADDR_ENDADDR_Pos))
#define HSMC_PMECCEADDR_Msk                   _U_(0x000001FF)                                      /**< (HSMC_PMECCEADDR) Register Mask  */


/* -------- HSMC_PMECCTRL : (SMC Offset: 0x84) ( /W 32) PMECC Control Register -------- */
#define HSMC_PMECCTRL_RST_Pos                 _U_(0)                                               /**< (HSMC_PMECCTRL) Reset the PMECC Module Position */
#define HSMC_PMECCTRL_RST_Msk                 (_U_(0x1) << HSMC_PMECCTRL_RST_Pos)                  /**< (HSMC_PMECCTRL) Reset the PMECC Module Mask */
#define HSMC_PMECCTRL_RST(value)              (HSMC_PMECCTRL_RST_Msk & ((value) << HSMC_PMECCTRL_RST_Pos))
#define HSMC_PMECCTRL_DATA_Pos                _U_(1)                                               /**< (HSMC_PMECCTRL) Start a Data Phase Position */
#define HSMC_PMECCTRL_DATA_Msk                (_U_(0x1) << HSMC_PMECCTRL_DATA_Pos)                 /**< (HSMC_PMECCTRL) Start a Data Phase Mask */
#define HSMC_PMECCTRL_DATA(value)             (HSMC_PMECCTRL_DATA_Msk & ((value) << HSMC_PMECCTRL_DATA_Pos))
#define HSMC_PMECCTRL_USER_Pos                _U_(2)                                               /**< (HSMC_PMECCTRL) Start a User Mode Phase Position */
#define HSMC_PMECCTRL_USER_Msk                (_U_(0x1) << HSMC_PMECCTRL_USER_Pos)                 /**< (HSMC_PMECCTRL) Start a User Mode Phase Mask */
#define HSMC_PMECCTRL_USER(value)             (HSMC_PMECCTRL_USER_Msk & ((value) << HSMC_PMECCTRL_USER_Pos))
#define HSMC_PMECCTRL_ENABLE_Pos              _U_(4)                                               /**< (HSMC_PMECCTRL) PMECC Enable Position */
#define HSMC_PMECCTRL_ENABLE_Msk              (_U_(0x1) << HSMC_PMECCTRL_ENABLE_Pos)               /**< (HSMC_PMECCTRL) PMECC Enable Mask */
#define HSMC_PMECCTRL_ENABLE(value)           (HSMC_PMECCTRL_ENABLE_Msk & ((value) << HSMC_PMECCTRL_ENABLE_Pos))
#define HSMC_PMECCTRL_DISABLE_Pos             _U_(5)                                               /**< (HSMC_PMECCTRL) PMECC Enable Position */
#define HSMC_PMECCTRL_DISABLE_Msk             (_U_(0x1) << HSMC_PMECCTRL_DISABLE_Pos)              /**< (HSMC_PMECCTRL) PMECC Enable Mask */
#define HSMC_PMECCTRL_DISABLE(value)          (HSMC_PMECCTRL_DISABLE_Msk & ((value) << HSMC_PMECCTRL_DISABLE_Pos))
#define HSMC_PMECCTRL_Msk                     _U_(0x00000037)                                      /**< (HSMC_PMECCTRL) Register Mask  */


/* -------- HSMC_PMECCSR : (SMC Offset: 0x88) ( R/ 32) PMECC Status Register -------- */
#define HSMC_PMECCSR_BUSY_Pos                 _U_(0)                                               /**< (HSMC_PMECCSR) The kernel of the PMECC is busy Position */
#define HSMC_PMECCSR_BUSY_Msk                 (_U_(0x1) << HSMC_PMECCSR_BUSY_Pos)                  /**< (HSMC_PMECCSR) The kernel of the PMECC is busy Mask */
#define HSMC_PMECCSR_BUSY(value)              (HSMC_PMECCSR_BUSY_Msk & ((value) << HSMC_PMECCSR_BUSY_Pos))
#define HSMC_PMECCSR_ENABLE_Pos               _U_(4)                                               /**< (HSMC_PMECCSR) PMECC Enable bit Position */
#define HSMC_PMECCSR_ENABLE_Msk               (_U_(0x1) << HSMC_PMECCSR_ENABLE_Pos)                /**< (HSMC_PMECCSR) PMECC Enable bit Mask */
#define HSMC_PMECCSR_ENABLE(value)            (HSMC_PMECCSR_ENABLE_Msk & ((value) << HSMC_PMECCSR_ENABLE_Pos))
#define HSMC_PMECCSR_Msk                      _U_(0x00000011)                                      /**< (HSMC_PMECCSR) Register Mask  */


/* -------- HSMC_PMECCIER : (SMC Offset: 0x8C) ( /W 32) PMECC Interrupt Enable register -------- */
#define HSMC_PMECCIER_ERRIE_Pos               _U_(0)                                               /**< (HSMC_PMECCIER) Error Interrupt Enable Position */
#define HSMC_PMECCIER_ERRIE_Msk               (_U_(0x1) << HSMC_PMECCIER_ERRIE_Pos)                /**< (HSMC_PMECCIER) Error Interrupt Enable Mask */
#define HSMC_PMECCIER_ERRIE(value)            (HSMC_PMECCIER_ERRIE_Msk & ((value) << HSMC_PMECCIER_ERRIE_Pos))
#define HSMC_PMECCIER_Msk                     _U_(0x00000001)                                      /**< (HSMC_PMECCIER) Register Mask  */


/* -------- HSMC_PMECCIDR : (SMC Offset: 0x90) ( /W 32) PMECC Interrupt Disable Register -------- */
#define HSMC_PMECCIDR_ERRID_Pos               _U_(0)                                               /**< (HSMC_PMECCIDR) Error Interrupt Disable Position */
#define HSMC_PMECCIDR_ERRID_Msk               (_U_(0x1) << HSMC_PMECCIDR_ERRID_Pos)                /**< (HSMC_PMECCIDR) Error Interrupt Disable Mask */
#define HSMC_PMECCIDR_ERRID(value)            (HSMC_PMECCIDR_ERRID_Msk & ((value) << HSMC_PMECCIDR_ERRID_Pos))
#define HSMC_PMECCIDR_Msk                     _U_(0x00000001)                                      /**< (HSMC_PMECCIDR) Register Mask  */


/* -------- HSMC_PMECCIMR : (SMC Offset: 0x94) ( R/ 32) PMECC Interrupt Mask Register -------- */
#define HSMC_PMECCIMR_ERRIM_Pos               _U_(0)                                               /**< (HSMC_PMECCIMR) Error Interrupt Mask Position */
#define HSMC_PMECCIMR_ERRIM_Msk               (_U_(0x1) << HSMC_PMECCIMR_ERRIM_Pos)                /**< (HSMC_PMECCIMR) Error Interrupt Mask Mask */
#define HSMC_PMECCIMR_ERRIM(value)            (HSMC_PMECCIMR_ERRIM_Msk & ((value) << HSMC_PMECCIMR_ERRIM_Pos))
#define HSMC_PMECCIMR_Msk                     _U_(0x00000001)                                      /**< (HSMC_PMECCIMR) Register Mask  */


/* -------- HSMC_PMECCISR : (SMC Offset: 0x98) ( R/ 32) PMECC Interrupt Status Register -------- */
#define HSMC_PMECCISR_ERRIS_Pos               _U_(0)                                               /**< (HSMC_PMECCISR) Error Interrupt Status Register Position */
#define HSMC_PMECCISR_ERRIS_Msk               (_U_(0xFF) << HSMC_PMECCISR_ERRIS_Pos)               /**< (HSMC_PMECCISR) Error Interrupt Status Register Mask */
#define HSMC_PMECCISR_ERRIS(value)            (HSMC_PMECCISR_ERRIS_Msk & ((value) << HSMC_PMECCISR_ERRIS_Pos))
#define HSMC_PMECCISR_Msk                     _U_(0x000000FF)                                      /**< (HSMC_PMECCISR) Register Mask  */


/* -------- HSMC_ELCFG : (SMC Offset: 0x500) (R/W 32) PMECC Error Location Configuration Register -------- */
#define HSMC_ELCFG_SECTORSZ_Pos               _U_(0)                                               /**< (HSMC_ELCFG) Sector Size Position */
#define HSMC_ELCFG_SECTORSZ_Msk               (_U_(0x1) << HSMC_ELCFG_SECTORSZ_Pos)                /**< (HSMC_ELCFG) Sector Size Mask */
#define HSMC_ELCFG_SECTORSZ(value)            (HSMC_ELCFG_SECTORSZ_Msk & ((value) << HSMC_ELCFG_SECTORSZ_Pos))
#define HSMC_ELCFG_ERRNUM_Pos                 _U_(16)                                              /**< (HSMC_ELCFG) Number of Errors Position */
#define HSMC_ELCFG_ERRNUM_Msk                 (_U_(0x1F) << HSMC_ELCFG_ERRNUM_Pos)                 /**< (HSMC_ELCFG) Number of Errors Mask */
#define HSMC_ELCFG_ERRNUM(value)              (HSMC_ELCFG_ERRNUM_Msk & ((value) << HSMC_ELCFG_ERRNUM_Pos))
#define HSMC_ELCFG_Msk                        _U_(0x001F0001)                                      /**< (HSMC_ELCFG) Register Mask  */


/* -------- HSMC_ELPRIM : (SMC Offset: 0x504) ( R/ 32) PMECC Error Location Primitive Register -------- */
#define HSMC_ELPRIM_PRIMITIV_Pos              _U_(0)                                               /**< (HSMC_ELPRIM) Primitive Polynomial Position */
#define HSMC_ELPRIM_PRIMITIV_Msk              (_U_(0xFFFF) << HSMC_ELPRIM_PRIMITIV_Pos)            /**< (HSMC_ELPRIM) Primitive Polynomial Mask */
#define HSMC_ELPRIM_PRIMITIV(value)           (HSMC_ELPRIM_PRIMITIV_Msk & ((value) << HSMC_ELPRIM_PRIMITIV_Pos))
#define HSMC_ELPRIM_Msk                       _U_(0x0000FFFF)                                      /**< (HSMC_ELPRIM) Register Mask  */


/* -------- HSMC_ELEN : (SMC Offset: 0x508) ( /W 32) PMECC Error Location Enable Register -------- */
#define HSMC_ELEN_ENINIT_Pos                  _U_(0)                                               /**< (HSMC_ELEN) Error Location Enable Position */
#define HSMC_ELEN_ENINIT_Msk                  (_U_(0x3FFF) << HSMC_ELEN_ENINIT_Pos)                /**< (HSMC_ELEN) Error Location Enable Mask */
#define HSMC_ELEN_ENINIT(value)               (HSMC_ELEN_ENINIT_Msk & ((value) << HSMC_ELEN_ENINIT_Pos))
#define HSMC_ELEN_Msk                         _U_(0x00003FFF)                                      /**< (HSMC_ELEN) Register Mask  */


/* -------- HSMC_ELDIS : (SMC Offset: 0x50C) ( /W 32) PMECC Error Location Disable Register -------- */
#define HSMC_ELDIS_DIS_Pos                    _U_(0)                                               /**< (HSMC_ELDIS) Disable Error Location Engine Position */
#define HSMC_ELDIS_DIS_Msk                    (_U_(0x1) << HSMC_ELDIS_DIS_Pos)                     /**< (HSMC_ELDIS) Disable Error Location Engine Mask */
#define HSMC_ELDIS_DIS(value)                 (HSMC_ELDIS_DIS_Msk & ((value) << HSMC_ELDIS_DIS_Pos))
#define HSMC_ELDIS_Msk                        _U_(0x00000001)                                      /**< (HSMC_ELDIS) Register Mask  */


/* -------- HSMC_ELSR : (SMC Offset: 0x510) ( R/ 32) PMECC Error Location Status Register -------- */
#define HSMC_ELSR_BUSY_Pos                    _U_(0)                                               /**< (HSMC_ELSR) Error Location Engine Busy Position */
#define HSMC_ELSR_BUSY_Msk                    (_U_(0x1) << HSMC_ELSR_BUSY_Pos)                     /**< (HSMC_ELSR) Error Location Engine Busy Mask */
#define HSMC_ELSR_BUSY(value)                 (HSMC_ELSR_BUSY_Msk & ((value) << HSMC_ELSR_BUSY_Pos))
#define HSMC_ELSR_Msk                         _U_(0x00000001)                                      /**< (HSMC_ELSR) Register Mask  */


