Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/smc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SMC_CS_NUMBER register API structure */
typedef struct
{
  __IO  uint32_t                       HSMC_SETUP;         /**< Offset: 0x00 (R/W  32) Setup Register */
  __IO  uint32_t                       HSMC_PULSE;         /**< Offset: 0x04 (R/W  32) Pulse Register */
  __IO  uint32_t                       HSMC_CYCLE;         /**< Offset: 0x08 (R/W  32) Cycle Register */
  __IO  uint32_t                       HSMC_TIMINGS;       /**< Offset: 0x0C (R/W  32) Timings Register */
  __IO  uint32_t                       HSMC_MODE;          /**< Offset: 0x10 (R/W  32) Mode Register */
} smc_cs_number_registers_t;

/** \brief SMC_PMECC register API structure */
typedef struct
{
  __I   uint32_t                       HSMC_PMECC[14];     /**< Offset: 0x00 (R/   32) PMECC Redundancy 0 Register (sec_num = 0) */
  __I   uint8_t                        Reserved1[0x08];
} smc_pmecc_registers_t;

/** \brief SMC_REM register API structure */
typedef struct
{
  __I   uint32_t                       HSMC_REM0_;         /**< Offset: 0x00 (R/   32) PMECC Remainder 0 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM1_;         /**< Offset: 0x04 (R/   32) PMECC Remainder 1 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM2_;         /**< Offset: 0x08 (R/   32) PMECC Remainder 2 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM3_;         /**< Offset: 0x0C (R/   32) PMECC Remainder 3 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM4_;         /**< Offset: 0x10 (R/   32) PMECC Remainder 4 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM5_;         /**< Offset: 0x14 (R/   32) PMECC Remainder 5 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM6_;         /**< Offset: 0x18 (R/   32) PMECC Remainder 6 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM7_;         /**< Offset: 0x1C (R/   32) PMECC Remainder 7 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM8_;         /**< Offset: 0x20 (R/   32) PMECC Remainder 8 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM9_;         /**< Offset: 0x24 (R/   32) PMECC Remainder 9 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM10_;        /**< Offset: 0x28 (R/   32) PMECC Remainder 10 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM11_;        /**< Offset: 0x2C (R/   32) PMECC Remainder 11 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM12_;        /**< Offset: 0x30 (R/   32) PMECC Remainder 12 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM13_;        /**< Offset: 0x34 (R/   32) PMECC Remainder 13 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM14_;        /**< Offset: 0x38 (R/   32) PMECC Remainder 14 Register (sec_num = 0) */
  __I   uint32_t                       HSMC_REM15_;        /**< Offset: 0x3C (R/   32) PMECC Remainder 15 Register (sec_num = 0) */
} smc_rem_registers_t;

#define SMC_PMECC_NUMBER _U_(8)

#define SMC_REM_NUMBER _U_(8)

#define SMC_CS_NUMBER_NUMBER _U_(4)

/** \brief SMC register API structure */
typedef struct
{
  __IO  uint32_t                       HSMC_CFG;           /**< Offset: 0x00 (R/W  32) NFC Configuration Register */
  __O   uint32_t                       HSMC_CTRL;          /**< Offset: 0x04 ( /W  32) NFC Control Register */
  __I   uint32_t                       HSMC_SR;            /**< Offset: 0x08 (R/   32) NFC Status Register */
  __O   uint32_t                       HSMC_IER;           /**< Offset: 0x0C ( /W  32) NFC Interrupt Enable Register */
  __O   uint32_t                       HSMC_IDR;           /**< Offset: 0x10 ( /W  32) NFC Interrupt Disable Register */
  __I   uint32_t                       HSMC_IMR;           /**< Offset: 0x14 (R/   32) NFC Interrupt Mask Register */
  __IO  uint32_t                       HSMC_ADDR;          /**< Offset: 0x18 (R/W  32) NFC Address Cycle Zero Register */
  __IO  uint32_t                       HSMC_BANK;          /**< Offset: 0x1C (R/W  32) Bank Address Register */
  __I   uint8_t                        Reserved1[0x50];
  __IO  uint32_t                       HSMC_PMECCFG;       /**< Offset: 0x70 (R/W  32) PMECC Configuration Register */
  __IO  uint32_t                       HSMC_PMECCSAREA;    /**< Offset: 0x74 (R/W  32) PMECC Spare Area Size Register */
  __IO  uint32_t                       HSMC_PMECCSADDR;    /**< Offset: 0x78 (R/W  32) PMECC Start Address Register */
  __IO  uint32_t                       HSMC_PMECCEADDR;    /**< Offset: 0x7C (R/W  32) PMECC End Address Register */
  __I   uint8_t                        Reserved2[0x04];
  __O   uint32_t                       HSMC_PMECCTRL;      /**< Offset: 0x84 ( /W  32) PMECC Control Register */
  __I   uint32_t                       HSMC_PMECCSR;       /**< Offset: 0x88 (R/   32) PMECC Status Register */
  __O   uint32_t                       HSMC_PMECCIER;      /**< Offset: 0x8C ( /W  32) PMECC Interrupt Enable register */
  __O   uint32_t                       HSMC_PMECCIDR;      /**< Offset: 0x90 ( /W  32) PMECC Interrupt Disable Register */
  __I   uint32_t                       HSMC_PMECCIMR;      /**< Offset: 0x94 (R/   32) PMECC Interrupt Mask Register */
  __I   uint32_t                       HSMC_PMECCISR;      /**< Offset: 0x98 (R/   32) PMECC Interrupt Status Register */
  __I   uint8_t                        Reserved3[0x14];
        smc_pmecc_registers_t          SMC_PMECC[SMC_PMECC_NUMBER]; /**< Offset: 0xB0  */
        smc_rem_registers_t            SMC_REM[SMC_REM_NUMBER]; /**< Offset: 0x2B0  */
  __I   uint8_t                        Reserved4[0x50];
  __IO  uint32_t                       HSMC_ELCFG;         /**< Offset: 0x500 (R/W  32) PMECC Error Location Configuration Register */
  __I   uint32_t                       HSMC_ELPRIM;        /**< Offset: 0x504 (R/   32) PMECC Error Location Primitive Register */
  __O   uint32_t                       HSMC_ELEN;          /**< Offset: 0x508 ( /W  32) PMECC Error Location Enable Register */
  __O   uint32_t                       HSMC_ELDIS;         /**< Offset: 0x50C ( /W  32) PMECC Error Location Disable Register */
  __I   uint32_t                       HSMC_ELSR;          /**< Offset: 0x510 (R/   32) PMECC Error Location Status Register */
  __O   uint32_t                       HSMC_ELIER;         /**< Offset: 0x514 ( /W  32) PMECC Error Location Interrupt Enable register */
  __O   uint32_t                       HSMC_ELIDR;         /**< Offset: 0x518 ( /W  32) PMECC Error Location Interrupt Disable Register */
  __I   uint32_t                       HSMC_ELIMR;         /**< Offset: 0x51C (R/   32) PMECC Error Location Interrupt Mask Register */
  __I   uint32_t                       HSMC_ELISR;         /**< Offset: 0x520 (R/   32) PMECC Error Location Interrupt Status Register */
  __I   uint8_t                        Reserved5[0x04];
  __I   uint32_t                       HSMC_SIGMA0;        /**< Offset: 0x528 (R/   32) PMECC Error Location SIGMA 0 Register */
  __IO  uint32_t                       HSMC_SIGMA1;        /**< Offset: 0x52C (R/W  32) PMECC Error Location SIGMA 1 Register */
  __IO  uint32_t                       HSMC_SIGMA2;        /**< Offset: 0x530 (R/W  32) PMECC Error Location SIGMA 2 Register */
  __IO  uint32_t                       HSMC_SIGMA3;        /**< Offset: 0x534 (R/W  32) PMECC Error Location SIGMA 3 Register */
  __IO  uint32_t                       HSMC_SIGMA4;        /**< Offset: 0x538 (R/W  32) PMECC Error Location SIGMA 4 Register */
  __IO  uint32_t                       HSMC_SIGMA5;        /**< Offset: 0x53C (R/W  32) PMECC Error Location SIGMA 5 Register */
  __IO  uint32_t                       HSMC_SIGMA6;        /**< Offset: 0x540 (R/W  32) PMECC Error Location SIGMA 6 Register */
  __IO  uint32_t                       HSMC_SIGMA7;        /**< Offset: 0x544 (R/W  32) PMECC Error Location SIGMA 7 Register */
  __IO  uint32_t                       HSMC_SIGMA8;        /**< Offset: 0x548 (R/W  32) PMECC Error Location SIGMA 8 Register */
  __IO  uint32_t                       HSMC_SIGMA9;        /**< Offset: 0x54C (R/W  32) PMECC Error Location SIGMA 9 Register */
  __IO  uint32_t                       HSMC_SIGMA10;       /**< Offset: 0x550 (R/W  32) PMECC Error Location SIGMA 10 Register */
  __IO  uint32_t                       HSMC_SIGMA11;       /**< Offset: 0x554 (R/W  32) PMECC Error Location SIGMA 11 Register */
  __IO  uint32_t                       HSMC_SIGMA12;       /**< Offset: 0x558 (R/W  32) PMECC Error Location SIGMA 12 Register */
  __IO  uint32_t                       HSMC_SIGMA13;       /**< Offset: 0x55C (R/W  32) PMECC Error Location SIGMA 13 Register */
  __IO  uint32_t                       HSMC_SIGMA14;       /**< Offset: 0x560 (R/W  32) PMECC Error Location SIGMA 14 Register */
  __IO  uint32_t                       HSMC_SIGMA15;       /**< Offset: 0x564 (R/W  32) PMECC Error Location SIGMA 15 Register */
  __IO  uint32_t                       HSMC_SIGMA16;       /**< Offset: 0x568 (R/W  32) PMECC Error Location SIGMA 16 Register */
  __IO  uint32_t                       HSMC_SIGMA17;       /**< Offset: 0x56C (R/W  32) PMECC Error Location SIGMA 17 Register */
  __IO  uint32_t                       HSMC_SIGMA18;       /**< Offset: 0x570 (R/W  32) PMECC Error Location SIGMA 18 Register */
  __IO  uint32_t                       HSMC_SIGMA19;       /**< Offset: 0x574 (R/W  32) PMECC Error Location SIGMA 19 Register */
  __IO  uint32_t                       HSMC_SIGMA20;       /**< Offset: 0x578 (R/W  32) PMECC Error Location SIGMA 20 Register */
  __IO  uint32_t                       HSMC_SIGMA21;       /**< Offset: 0x57C (R/W  32) PMECC Error Location SIGMA 21 Register */
  __IO  uint32_t                       HSMC_SIGMA22;       /**< Offset: 0x580 (R/W  32) PMECC Error Location SIGMA 22 Register */
  __IO  uint32_t                       HSMC_SIGMA23;       /**< Offset: 0x584 (R/W  32) PMECC Error Location SIGMA 23 Register */
  __IO  uint32_t                       HSMC_SIGMA24;       /**< Offset: 0x588 (R/W  32) PMECC Error Location SIGMA 24 Register */
  __IO  uint32_t                       HSMC_SIGMA25;       /**< Offset: 0x58C (R/W  32) PMECC Error Location SIGMA 25 Register */
  __IO  uint32_t                       HSMC_SIGMA26;       /**< Offset: 0x590 (R/W  32) PMECC Error Location SIGMA 26 Register */
  __IO  uint32_t                       HSMC_SIGMA27;       /**< Offset: 0x594 (R/W  32) PMECC Error Location SIGMA 27 Register */
  __IO  uint32_t                       HSMC_SIGMA28;       /**< Offset: 0x598 (R/W  32) PMECC Error Location SIGMA 28 Register */
  __IO  uint32_t                       HSMC_SIGMA29;       /**< Offset: 0x59C (R/W  32) PMECC Error Location SIGMA 29 Register */
  __IO  uint32_t                       HSMC_SIGMA30;       /**< Offset: 0x5A0 (R/W  32) PMECC Error Location SIGMA 30 Register */
  __IO  uint32_t                       HSMC_SIGMA31;       /**< Offset: 0x5A4 (R/W  32) PMECC Error Location SIGMA 31 Register */
  __IO  uint32_t                       HSMC_SIGMA32;       /**< Offset: 0x5A8 (R/W  32) PMECC Error Location SIGMA 32 Register */
  __I   uint32_t                       HSMC_ERRLOC[32];    /**< Offset: 0x5AC (R/   32) PMECC Error Location 0 Register */
  __I   uint8_t                        Reserved6[0xD4];
        smc_cs_number_registers_t      SMC_CS_NUMBER[SMC_CS_NUMBER_NUMBER]; /**< Offset: 0x700  */
  __I   uint8_t                        Reserved7[0x50];
  __IO  uint32_t                       HSMC_OCMS;          /**< Offset: 0x7A0 (R/W  32) Off Chip Memory Scrambling Register */
  __O   uint32_t                       HSMC_KEY1;          /**< Offset: 0x7A4 ( /W  32) Off Chip Memory Scrambling KEY1 Register */
  __O   uint32_t                       HSMC_KEY2;          /**< Offset: 0x7A8 ( /W  32) Off Chip Memory Scrambling KEY2 Register */
  __I   uint8_t                        Reserved8[0x38];
  __IO  uint32_t                       HSMC_WPMR;          /**< Offset: 0x7E4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       HSMC_WPSR;          /**< Offset: 0x7E8 (R/   32) Write Protection Status Register */
} smc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D2_SMC_COMPONENT_H_ */
